In [ ]:
# =============================================================================
# =============================================================================
# # 문제 10 유형(DataSet_10.csv 이용)
#
# 구분자 : comma(“,”), 1538 Rows, 6 Columns, UTF-8 인코딩

# 중고 자동차 가격에 대한 분석을 위하여 아래와 같은 데이터를
# 확보하였다.

# 컬 럼 / 정 의 / Type
# model / 모델명 / String
# engine_power / 엔진 파워 / Double
# age_in_days / 운행 일수 / Double
# km / 운행 거리 / Double
# previous_owners / 이전 소유자 수 / Double
# price / 중고차 가격 / Double
# =============================================================================
# =============================================================================

# =============================================================================
# (참고)
# #1
# import pandas as pd
# import numpy as np
# #2
# import scipy.stats as ststs
# #3
# from sklearn.linear_model import LinearRegression
# =============================================================================

In [5]:
import pandas as pd

dataset10 = pd.read_csv('Dataset/Dataset_10.csv')

In [6]:
dataset10.head()

,model,engine_power,age_in_days,km,previous_owners,price,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16
0,lounge,51,882,25000,1,8900,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,pop,51,1186,32500,1,8800,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,sport,74,4658,142228,1,4200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,lounge,51,2739,160000,1,6000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,pop,73,3074,106880,1,5700,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
#%%

# =============================================================================
# 1.이전 소유자 수가 한 명이고 엔진 파워가 51인 차에 대해 모델별 하루 평균 운행
# 거리를 산출하였을 때 가장 낮은 값을 가진 모델이 가장 큰 값을 가진 모델에 대한
# 비율은 얼마인가? 소수점 셋째 자리에서 반올림하여 소수점 둘째 자리까지
# 기술하시오.
# (모델별 평균 → 일평균 → 최대최소 비율 계산) (답안 예시) 0.12
# =============================================================================

In [49]:
q1 = dataset10.copy()

In [50]:
q1 = q1.iloc[:,:5]

In [51]:
q1 = q1[(q1['previous_owners'] == 1) & (q1['engine_power'] == 51)]

In [52]:
q1 = q1.pivot_table(index= 'model', values=["age_in_days","km"] )

In [53]:
q1['days'] = q1.km / q1.age_in_days

In [54]:
(q1.days.min() / q1.days.max()).round(2)
# 정답 : 0.97

0.97

In [55]:
q1

        age_in_days            km       days
model
lounge  1343.450366  44123.670846  32.843544
pop     1800.509804  58097.532680  32.267268
sport   3031.387755  96460.979592  31.820733

In [31]:
#%%

# =============================================================================
# 2.운행 일수에 대한 운행 거리를 산출하고, 위 1번 문제에서 가장 큰 값을 가지고 있던
# 모델과 가장 낮은 값을 가지고 있던 모델 간의 운행 일수 대비 운행거리 평균이 다른지
# 적절한 통계 검정을 수행하고 p-value를 소수점 세자리 이하는 버리고 소수점
# 두자리까지 기술하고 기각 여부를 Y / N로 답하시오. (등분산을 가정하고 equal_var = 
# True / var.equal = T로 분석을 실행하시오.)
# (답안 예시) 0.23, Y
# =============================================================================

In [58]:
q2 = dataset10.copy().iloc[:,:5]

q2['km_per_day'] = q2['km'] / q2['age_in_days']

big = q2[q2.model == 'lounge']['km_per_day']
small = q2[q2.model == 'sport']['km_per_day']

In [60]:
from scipy.stats import ttest_ind

ttest_ind(big, small, equal_var=True)

Ttest_indResult(statistic=1.5054268543179226, pvalue=0.13248244438755083)

In [ ]:
## 0.13, N

In [41]:
#%%

# =============================================================================
# 3.독립변수로 engine_power, age_in_days, km를 사용하고 종속변수로 price를 사용하여
# 모델별 선형회귀분석을 수행하고, 산출된 모형을 사용하여 다음과 같은 조건의
# 중고차에 대한 가격을 예측하고 예측된 가격을 정수부만 기술하시오.
# - model : pop / engine_power : 51 / age_in_days : 400 / km : 9500 / previous_owners : 2

# (답안 예시) 12345
# =============================================================================

In [68]:
q3 = dataset10.copy().iloc[:,:6]

new_data = pd.DataFrame({
    'model' : ['pop'],
    'engine_power' : [51],
    'age_in_days' : [400],
    'km' : [9500],
    'previous_owners' : [2]
    })

from sklearn.linear_model import LinearRegression
import numpy as np

x_var = ['engine_power', 'age_in_days', 'km']

lm = LinearRegression().fit(q3[x_var], q3.price)

new_data = pd.DataFrame({
    'model' : ['pop'],
    'engine_power' : [51],
    'age_in_days' : [400],
    'km' : [9500],
    'previous_owners' : [2]
    })

new_data2 = np.array([[51,400,9500]])


ans = lm.predict(new_data[x_var])
print(int(ans))

10469